Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/motor_tax_and_insurance/motor_tax_rates.html.txt.tmx
Source language: en
Languages: ga

source: It is a legal requirement to have motor tax if you want to drive your vehicle in a public place
ga: Is ceanglas dlíthiúil é mótarcháin a bheith íoctha agat más mian leat d’fheithicil a thiomáint in áit phoiblí

source: Motor tax is a charge imposed by the Government on some motor vehicles
ga: Is muirear mótarcháin a ghearrann an Rialtas ar roinnt mótharfheithiclí

source: Motor tax is collected by local authorities
ga: Bailíonn údaráis áitiúla mótarcháin

source: How your vehicle is assessed for motor tax depends on the type of vehicle you have
ga: Braitheann conas a mheasúnaítear d’fheithicil i dtaobh mótarchánach ar shaghas na feithicle atá agat

source: For example, it is assessed on the basis of:
ga: Mar shampla, déantar measúnú uirthi ar bhonn an mhéid seo a leanas:

source: • CO2 emission bands for private cars registered since July 2008 and private cars registered between January and June 2008 which opted for this basis of assessment. (Does not apply to second-hand imports that were registered abroad prior to 2008)
ga: • Bandaí astaíochtaí CO² le haghaidh gluaisteáin phríobháideacha a cláraíodh ó Iúil 2008 i leith agus gluaisteáin phríobháideacha a cláraíodh idir Eanáir agus Meitheamh 2008 a roghnaigh an bonn seo measúnaithe (Ní bhaineann seo le hiompórtálacha athláimhe a cláraíodh thar lear roimh 2008)

source: • Engine capacity (cc) for private cars registered before July 2008 and private goods vehicles, such as vans
ga: • Toilleadh innill (cc) le haghaidh gluaisteáin phríobháideacha a cláraíodh roimh Iúil 2008 agus feithiclí earraí príobháideacha, ar nós veaineanna

source: • Unladen weight for commercial goods vehicles
ga: • Meáchan neamhualaithe le haghaidh feithiclí earraí tráchtála

source: Not only are you obliged by law to pay motor tax to drive your vehicle, you are also required to display evidence that you have paid (that is, a current tax disc) on the windscreen of your vehicle
ga: Ní hamháin go leagann an dlí dualgas ort mótarcháin chun d’fheithicil a thiomáint, ach ceanglaítear ort fianaise a thaispeáint gur íoc tú aisti (is é sin, diosca reatha cánach) ar ghaothscáth d’fheithicle

source: Failure to display a current tax disc on your vehicle is considered a motoring offence and will result in a €60 fixed-charge fine issued by a traffic warden or a Garda
ga: Má theipeann ort diosca reatha cánach a thaispeáint ar d’fheithicil, meastar go bhfuil cion tiomána déanta agat agus eascróidh fíneáil mhuirir sheasta €60 as a eiseoidh maor tráchta nó Garda

source: Certain vehicles are exempt from the requirement to pay motor tax
ga: Tá feithiclí áirithe díolmhaithe ón gceanglas chun mótarcháin a íoc

source: However, if they are used in a public place a current tax disc must be displayed
ga: Má eisítear iad in áit phoiblí, caithfear diosca reatha cánach a thaispeáint

source: Among the vehicles exempt from the requirement to pay motor tax are:
ga: I measc na bhfeithiclí atá díolmhaithe ón gceanglas chun mótarcháin a íoc, tá an méid a leanas:

source: • Vehicles exempted under the Disabled Drivers and Disabled Passengers (Tax Concessions) Regulations, 1994 (SI 353/1994)
ga: • Feithiclí a dhéantar a dhíolmhú faoi na Rialacháin um Thiománaithe faoi Mhíchumas agus Paisinéirí faoi Mhíchumas (Lamháltais Chánach), 1994 (I.R

source: • Vehicles (including any cycle with an attachment for propelling it by mechanical power) not exceeding 400 kg in weight (unladen), which is adapted and used for invalids
ga: 353/1994) • Feithiclí (aon rothar san áireamh ar a bhfuil ceangal chun é a thiomáint de chumhacht mheicniúil) nach bhfuil níos troime ná 400 kg meáchain (neamhualaithe), a dhéantar a oiriúnú agus a úsáidtear d’easláin

source: You can find a list of exempt vehicles in the motor tax tables which are available on the Department of Housing, Planning, Community and Local Government website
ga: Féadfaidh tú teacht ar liosta d’fheithiclí díolmhaithe sna táblaí mótarchánach atá ar fáil ar láithreán gréasáin na Roinne Comhshaoil, Pobail agus Rialtais Áitiúil

source: Since January 2016, the rate of motor tax is reduced for all commercial goods vehicles above 4,000kgs, with a new annual rate of €500 for vehicle between 4,000 kg and 12,000 kg and €900 for vehicles over 12,000 kg
ga: Ó Eanáir 2016 i leith, laghdaítear an ráta mótarchánach do gach feithicil earraí tráchtála os cionn 4,000 kg, agus tugadh ráta nua bliantúil €500 d’fheithiclí idir 4,000 kg agus 12,000 kg agus ráta €900 d’fheithiclí os cionn 12,000 kg

source: Change of vehicle ownership and motor tax
ga: Athrú úinéireacht feithicle agus mótarcháin

source: If you sell your vehicle or trade it in for a replacement, you must register the change of ownership
ga: Má dhíolann tú d’fheithicil nó má dhéanann tú í a thrádáil isteach le haghaidh feithicil ionaid, ní mór duit an t-athrú úinéireachta a chlárú

source: This is done in one of two ways and depends on whether the vehicle was first registered before or after 1 January 1993
ga: Déantar seo ar bhealach amháin as dhá bhealach agus braitheann seo ar cé acu ar cláraíodh nó nár cláraíodh an fheithicil i dtosach báire roimh nó i ndiaidh an 1 Eanáir 1993

source: You cannot tax your new vehicle until the registration of the change of ownership has gone through
ga: Ní féidir leat íoc as cáin ar d’fheithicil nua go dtí go bhfuil clárú an athraithe úinéireachta tugtha chun críche

source: You can check the status of the vehicle on motortax.ie
ga: Féadfaidh tú stádas na feithicle a sheiceáil ar motortax.ie

source: You then renew the motor tax on the vehicle using Form RF100A or online as described below
ga: Ansin déanann tú an mhótarcháin a athnuachan ar an bhfeithicil agus Foirm RF100A á húsáid nó ar líne, faoi mar a ndéantar cur síos air thíos

source: If the motor tax on your new vehicle has already expired, you are not liable for the arrears period from the expiry of the last tax disc to the end of the month immediately preceding the date you bought it
ga: Má tá an mhótarcháin ar d’fheithicil nua éagtha cheana féin, níl tú faoi dhliteanas íoc as an tréimhse riaráistí ó éag an diosca cánach deiridh go dtí deiridh na míosa díreach roimh an dáta a cheannaigh tú í

source: It is an offence to drive without paying motor tax, so you should not drive until you have received confirmation that the registration has occurred and you have paid the motor tax
ga: Is cion é tiomáint gan mótarcháin a íoc, mar sin, níor cheart duit tiomáint go dtí go bhfuil deimhniú faighte agat gur tharla an clárúchán agus gur íoc tú an mhótarcháin

source: Read more in our document on change of vehicle ownership
ga: Féadfaidh tú níos mó a léamh inár gcáipéis ar athrú úinéireachta feithicle

source: Replacing a lost tax disc
ga: Diosca cánach a cailleadh a ionadú

source: It is possible to obtain replacement documents associated with motor tax
ga: Is féidir cáipéisí ionaid a fháil a bhaineann le mótarcháin

source: List of documents and the cost of their replacement is as follows;
ga: Soláthraítear thíos liosta cáipéisí agus an costas a bhíonn ar a n-ionadú;

source: │Document │Replacement cost │
ga: │Cáipéis │Costas ionaid │

source: │Tax disc │€6 │
ga: │Diosca cánach │€6 │

source: │Registration book/certificate │€12 │
ga: │Leabhar/deimhniú cláraithe │€12 │

source: │Vehicle licensing certificate │€12 │
ga: │Deimhniú ceadúnaithe feithicle │€12 │

source: To obtain replacement documents, complete Form RF134 (pdf) and have this form witnessed by a member of the Garda Síochána at a Garda station
ga: Chun cáipéisí ionaid a fháil, comhlánaigh Foirm RF134 (pdf) agus iarr go mbeidh comhalta den Gharda Síochána mar fhinné ar an bhfoirm seo ag stáisiún Gardaí

source: Forward your completed form with the appropriate fee to your Motor Tax Office
ga: Seol d’fhoirm chomhlánaithe leis an táille chuí ar aghaidh chuig d’Oifig Mhótarchánach

source: It is possible in certain circumstances, to claim a refund of motor tax
ga: Is féidir, faoi chúinsí áirithe, chun aisíocaíocht ar mhótarcháin a éileamh

source: Your application for a refund, should be made directly to your local motor tax office, on Form RF120 (pdf)
ga: Ba cheart go ndéanfar d’iarratas ar aisíocaíocht go díreach le d’oifig mhótarchánach áitiúil, ar Fhoirm RF120 (pdf)

source: Circumstances where you may claim a refund of motor tax include;
ga: I measc na gcúinsí inar féidir leat aisíocaíocht ar mhótarcháin a éileamh, tá an méid a leanas;

source: • The vehicle has been scrapped/destroyed or sent permanently out of the State
ga: • Rinneadh an fheithicil a bhriseadh/a mhilleadh nó a seoladh go buan lasmuigh den Stát

source: • The vehicle has been stolen and has not been recovered by the owner
ga: • Goideadh an fheithicil agus níor éirigh leis an úinéir í a aisghabháil

source: • The vehicle has not been taken out or used in a public place at any time since the issue of the current disc
ga: • Níor glacadh an fheithicil amach nó níor úsáideadh a fheithicil in áit phoiblí ag aon tráth ó eisíodh an diosca reatha

source: • The owner of the vehicle has ceased, because of illness, injury or other physical disability, to use the vehicle
ga: • Chuir úinéir na feithicle, mar gheall ar bhreoiteacht, gortú nó míchumas fisiciúil eile, deireadh le húsáid a bhaint as an bhfeithicil

source: • The owner of the vehicle has ceased, because of absence from the state for business or educational purposes, to use the vehicle
ga: • Chuir úinéir na feithicle, mar gheall ar asláithreacht ón stát ar mhaithe le cuspóirí gnó nó oideachais, deireadh le húsáid a bhaint as an bhfeithicil

source: • The owner of the vehicle has ceased, because of service overseas with the Defence Forces, to use the vehicle
ga: • Chuir úinéir na feithicle, mar gheall ar sheirbhís thar lear leis na Fórsaí Cosanta, deireadh le húsáid a bhaint as an bhfeithicil

source: Tax discs must be surrendered immediately as refunds are generally calculated from the first of the month following the surrender of the disc
ga: Caithfear dioscaí cánach a thabhairt suas láithreach mar gheall go ríomhtar aisíocaíochtaí, go ginearálta, ón gcéad mhí i ndiaidh an diosca a thabhairt suas

source: A minimum of three unexpired whole calendar months must be left on the disc when surrendered
ga: Ní mór trí mhí iomlána neamhéagtha féilire, ar a laghad, a fhágáil ar an diosca nuair a thugtar suas é

source: Where a vehicle has been scrapped you will need a certificate of destruction issued by an End-of-Life Vehicle (ELV) Authorised Treatment Facility
ga: Sa chás go ndearnadh feithicil a bhriseadh, teastóidh deimhniú scriosta uait a eisíonn Saoráid Chóireála Údaraithe Feithicle a bhfuil a Ré Caite (ELV)

source: Vehicle off the road
ga: Feithicil nach bhfuil á tiomáint ar an mbóthar

source: New procedures have been introduced for declaring a vehicle is temporarily off the road so that you do not have to pay motor tax for that period
ga: Tugadh nósanna imeachta nua lena dhearbhú nach bhfuil feithicil á tiomáint ar an mbóthar ionas nach bhfuil ort íoc as mótarcháin don tréimhse sin

source: Since 1 October 2013 you are required to declare in advance that your vehicle will be off the road and not in use for a period of between 3 and 12 months using Declaration of Non-Use of a Motor Vehicle Form RF150 (pdf), which you submit to your motor tax office
ga: Ón 1 Deireadh Fómhair 2013, tá ort a dhearbhú roimh ré nach mbeidh d’fheithicil á tiomáint ar an mbóthar agus nach mbainfear úsáid aisti ar feadh tréimhse idir 3 agus 12 mhí agus leas á bhaint as Dearbhú um Neamhúsáid Mótarfheithicle Foirm RF150 (pdf)

source: The declaration of non-use must be made in the same month that your current motor tax disc expires
ga: Ní mór an dearbhú um neamhúsáid a dhéanamh sa mhí chéanna ina n-éagann do dhiosca reatha mótarchánach

source: If arrears in motor tax are due these must be paid in full and you must also pay a minimum of 3 months motor tax, before a declaration of non-use can be made
ga: Má tá riaráistí mótarchánach le híoc, ní mór iad seo a íoc ina n-iomláine agus ní mór mótarcháin a íoc ar feadh 3 mhí, ar a laghad, chomh maith leis sin, sular féidir an dearbhú um neamhúsáid a dhéanamh

source: A motor tax disc is issued for 3, 6 or 12 months and how the rate is calculated depends on the type of vehicle
ga: Eisítear diosca mótarchánach ar feadh 3, 6, nó 12 mhí agus braitheann conas a ríomhtar an ráta ar shaghas na feithicle

source: Motor tax applies to the following vehicles: private cars, motorcycles, goods vehicles, taxis, large public service vehicles, (PSV's)/community buses and agricultural, and commercial building construction vehicles
ga: Baineann mótarcháin leis na feithiclí a leanas: gluaisteáin phríobháideacha, gluaisrothair, feithiclí earraí, tacsaithe, feithiclí móra seirbhíse poiblí (FSPanna)/busanna pobail agus feithiclí talmhaíochta agus feithiclí tógála foirgníocht tráchtála

source: On the Department of Housing, Planning, Community and Local Government's website you can view the motor tax rates
ga: Ar láithreán gréasáin na Roinne Comhshaoil, Pobail agus Rialtais Áitiúil, féadfaidh tú súil a chaitheamh ar na rátaí mótarchánach

source: Motor tax rates are also available at motortax.ie
ga: Chomh maith leis sin, tá rátaí mótarchánach ar fáil ag motortax.ie

source: On the Sustainable Energy Authority of Ireland (SEAI) Power of One website you can check the CO2 emissions levels for different car models
ga: Ar láithreán gréasáin Power of One de chuid Údarás Fuinnimh Inmharthana na hÉireann (an SEAI), féadfaidh tú súil a chaitheamh ar na leibhéil astaíochtaí CO² le haghaidh samhlacha éagsúla gluaisteáin

source: A 'vintage' vehicle for motor taxation purposes is a vehicle that is 30 or more years old
ga: Is ionann feithicil ‘seanré’, ar mhaithe le cuspóirí cánachais, agus feithicil atá 30 bliain d’aois nó níos sine

source: In determining whether or not the vehicle qualifies for 'vintage' status - the chassis number of the vehicle and the vehicle registration book/vehicle registration certificate must clearly display the age of the vehicle
ga: Nuair a dheimhnítear cé acu an gcáilíonn nó nach gcáilíonn an fheithicil do stádas ‘seanré’ – ní mór go léirítear go soiléir ar uimhir fonnaidh na feithicle agus leabhar cláraithe/deimhniú cláraithe na feithicle aois na feithicle

source: Regarding the purchase of new or second-hand vehicles, there is no charge for registering Change of Ownership details at Motor Taxation Offices or at the Vehicle Registration Unit
ga: Maidir le feithiclí nua nó athláimhe a cheannach, ní ghearrtar aon mhuirear ar shonraí faoi Athrú Úinéireachta a chlárú ag Oifigí Mótarchánach nó ag an Aonad Clárúcháin Feithiclí

source: You can tax a vehicle online, or by post or visit to a Motor Taxation Office in the county in which the vehicle is ordinarily kept
ga: Féadfaidh tú cáin a íoc ar fheithicil ar líne, nó tríd an bpost nó trí chuairt a thabhairt ar Oifig Mhótarchánach sa chontae ina gcoimeádtar an fheithicil de ghnáth

source: Taxing a new vehicle
ga: Cáin a íoc ar fheithicil nua

source: If your vehicle is new, you need a 'First Motor Tax Application' Form RF100
ga: Má tá d’fheithicil nua, teastaíonn ‘Iarratas ar Mhótarcháin den Chéad Uair’ Foirm RF100 uait

source: This is available from the motor dealer or person from whom you bought your vehicle
ga: Tá seo ar fáil ón déileálaí gluaisteán nó ón duine ónar cheannaigh tú d’fheithicil

source: When you are applying for first motor tax, you must present the following documents at your local Motor Taxation Office:
ga: Nuair a dhéanann tú iarratas ar mhótarcháin den chéad uair, ní mór duit na cáipéisí a leanas a sholáthar ag d’Oifig Mhótarchánach áitiúil;

source: • Form RF100 (motorcycle (pdf), other vehicle (pdf))
ga: • Foirm RF100 gluaisrothar (pdf), feithicil eile (pdf)

source: A certificate of approval from Revenue for a disabled driver/passenger is also required if the vehicle is exempted from motor tax under the Disabled Drivers and Disabled Passengers (Tax Concessions) Regulations
ga: Teastaíonn deimhniú faofa ó na Coimisinéirí Ioncaim do thiománaí/phaisinéir faoi mhíchumas, chomh maith, má tá an fheithicil díolmhaithe ó mhótarcháin faoi na Rialacháin um Thiománaithe faoi Mhíchumas agus Paisinéirí faoi Mhíchumas (Lamháltais Chánach)

source: You can also tax a new vehicle online
ga: Féadfaidh tú cáin a íoc ar fheithicil nua ar líne, chomh maith

source: Goods or commercial vehicles
ga: Feithiclí earraí nó tráchtála

source: There are additional requirements when taxing a goods/commercial vehicle
ga: Tá riachtanais bhreise ann nuair a ghearrtar cáin ar fheithicil earraí/tráchtála

source: If the unladen weight exceeds 1,524 kg (3,500 kg Gross Vehicle Weight), a weight docket (from an authorised weighbridge) is required
ga: Má sháraíonn an t-ualach neamhualaithe 1,524 kg (Ollualach Feithicle 3,500 kg), teastaíonn duillín meáchain (ó dhroichead meáite údaraithe)

source: If the unladen weight does not exceed 1,524 kg (3,500 kg Gross Vehicle Weight), a goods declaration form RF111A (pdf) (from Motor Tax Office) is required
ga: Mura sáraíonn an t-ualach neamhualaithe 1,524kg (Ollualach Feithicle 3,500 kg), teastaíonn foirm dhearbhaithe earraí RF111A (pdf) (ó Oifig Mhótarchánach)

source: This must be witnessed in a Garda station
ga: Ní mór go mbeidh comhalta den Gharda Síochána i Stáisiún Gardaí mar fhinné air seo

source: Additional proof that the vehicle is being appropriately taxed may be required, such as:
ga: B’fhéidir go dteastóidh fianaise bhreise go bhfuil an cháin chuí á gearradh ar an bhfeithicil, ar nós an mhéid seo a leanas:

source: • Current commercial insurance certificate for the vehicle
ga: • Deimhniú reatha árachas tráchtála don fheithicil

source: • Evidence of registration for VAT
ga: • Fianaise ar chlárú le haghaidh CBL

source: • Notice of Tax Registration Form
ga: • Fógra ar Fhoirm Chláraithe Cánach

source: If you are an employee and you use your vehicle solely for the carriage of goods in the course of your employment, you will require a letter from your employer to that effect
ga: Más fostaí thú agus má úsáideann tú d’fheithicil díreach ar mhaithe le hearraí a iompar i gcaitheamh d’fhostaíochta, teastóidh litir uait ó d’fhostóir a dhearbhaíonn amhlaidh

source: The letter should also provide information about your employer, such as, the nature of the business and its Tax Registration Number
ga: Ba cheart go dtabharfaí faisnéis sa litir, chomh maith, faoi d’fhostóir, ar nós chineál an ghnólachta agus a Uimhir Chláraithe Cánach

source: If the vehicle is one year old or over (for example, imported) a certificate of roadworthiness/pass statement (from an authorised tester) is required
ga: Má tá an fheithicil bliain d’aois nó níos sine (mar shampla, má rinneadh í a iompórtáil), teastaíonn deimhniú ródacmhainneachta/ráiteas pas (ó thástálaí údaraithe)

source: If the vehicle is imported, a weight docket (from an authorised weighbridge) is required
ga: Má tá an fheithicil iompórtáilte, teastaíonn duillín meáite (ó dhroichead meáite údaraithe)

source: Other vehicles have additional requirements as follows:
ga: Baineann na riachtanais bhreise a leanas le feithiclí eile:

source: • PSV licence in the case of small and large public service vehicles
ga: • Ceadúnas FSP i gcás feithiclí beaga agus móra seirbhíse poiblí

source: • Article 60 licence for school buses
ga: • Ceadúnas Airteagal 60 le haghaidh busanna scoile

source: • A certificate of roadworthiness/pass statement issued by an authorised tester for large public service vehicles and ambulances that are 1 year old or over
ga: • Eisíonn tástálaí údaraithe feithiclí móra seirbhíse poiblí agus otharcharranna atá 1 bhliain d’aois nó níos sine deimhniú ródacmhainneachta/ráiteas pas

source: • A recovery vehicle declaration Form RF111B (from Motor Tax Office) for recovery vehicles
ga: • Foirm dhearbhaithe feithicil tarrthála Foirm RF111B (ó Oifig Mhótarchánach) le haghaidh feithiclí tarrthála

source: Renewing your motor tax
ga: Do mhótarcháin a athnuachan

source: You can renew your motor tax up to 1 month before your tax is due to expire
ga: Féadfaidh tú do mhótarcháin a athnuachan a fhad le 1 mhí sula mbíonn do cháin le dul in éag

source: In general, two forms are available for the purpose of renewing motor tax - Motor Tax Renewal Form RF100A (pdf) and Motor Tax Renewal Form RF100B
ga: Go ginearálta, tá dhá fhoirm ar fáil ar mhaithe le mótarcháin a athnuachan – Foirm Athnuachana Mótarchánach RF100A (pdf) agus Foirm Athnuachana Mótarchánach RF100B

source: The only difference between these two forms is that the RF100B is a computer-printed form which is automatically posted to you about a month before your tax is due to expire, while the RF100A is available from your Motor Taxation Offices, public libraries and Garda stations
ga: Is í an t-aon difríocht idir an dá fhoirm seo ná gur foirm ríomhchlóite í RF100B a sheoltar chugat go huathoibríoch sa phost thart ar mhí sula mbíonn do cháin le dul in éag, agus tá RF100A ar fáil ó d’Oifigí Mótarchánach, leabharlanna poiblí agus stáisiúin Ghardaí

source: Not everyone receives a form in the post, so it is up to you to keep check of when your tax expires
ga: Ní fhaigheann gach duine foirm sa phost, mar sin, is fútsa a bhíonn sé a sheiceáil cathain a rachaidh do cháin in éag

source: The completed form should be returned to your local Motor Taxation Office in person or by post
ga: Ba cheart an fhoirm chomhlánaithe a sheoladh ar ais chuig d’Oifig Mhótarchánach áitiúil i bpearsan nó sa phost

source: (See 'Taxing your vehicle online' below.) If you apply in person you will receive your new tax disc there and then
ga: (Féach ‘Cáin a íoc ar d’fheithicil ar líne’ thíos.) Má dhéanann tú iarratas i bpearsan, gheobhaidh tú do dhiosca nua láithreach bonn

source: If you make a postal application, you should allow up to 3 weeks to receive your new disc
ga: Má dhéanann tú iarratas sa phost, ba cheart duit a fhad le 3 seachtaine a thabhairt sula bhfaighidh tú do dhiosca nua

source: • To renew your motor tax where there is no change in owner or vehicle details (for example, name, address, or engine size) you can complete Form RF100B (computerised reminder form) or Form RF100A
ga: • Chun do mhótarcháin a athnuachan sa chás nach dtagann aon athrú ar an úinéir nó ar shonraí na feithicle (mar shampla, ainm, seoladh, nó toilleadh innill), féadfaidh tú Foirm RF100B a chomhlánú (foirm mheabhrúcháin ríomhairithe) nó Foirm RF100A a chomhlánú

source: • To renew your motor tax where there is a change in owner details (for example, name) you must use Form RF100A
ga: • Chun do mhótarcháin a athnuachan sa chás go dtagann athrú ar shonraí an úinéara (ainm an úinéara, mar shampla), ní mór duit Foirm RF100A a úsáid

source: • To renew your motor tax where there is a change in vehicle details (for example, engine size) you must use Change of Particulars Form RF111 (pdf)
ga: • Chun do mhótarcháin a athnuachan sa chás go dtagann athrú ar shonraí na feithicle ( mar shampla, toilleadh innill), ní mór duit Foirm um Athrú Critéar RF111 (pdf) a úsáid

source: The appropriate fee must be submitted with your renewal form. A certificate of approval from Revenue for a disabled driver or passenger is also required if the vehicle is exempted from motor tax
ga: Ní mór an táille chuí a sheoladh ar aghaidh le d’fhoirm athnuachana Teastaíonn deimhniú faofa ó na Coimisinéirí Ioncaim do thiománaí/phaisinéir faoi mhíchumas, chomh maith, má tá an fheithicil díolmhaithe ó mhótarcháin

source: Goods and other vehicles
ga: Feithiclí earraí agus feithiclí eile
